yeeeec/stm32h7boot/Drivers/Devices/Stm32RomBoot/stm32_rom_boot.c
#include "stm32_rom_boot.h"

#include <stddef.h>

#define ROM_SYNC 0x7FU
#define ROM_ACK  0x79U
#define ROM_NACK 0x1FU

#define ROM_CMD_GET            0x00U
#define ROM_CMD_GET_ID         0x02U
#define ROM_CMD_READ_MEMORY    0x11U
#define ROM_CMD_WRITE_MEMORY   0x31U
#define ROM_CMD_ERASE          0x43U
#define ROM_CMD_EXTENDED_ERASE 0x44U

#define ROM_VERSION_V91 0x91U

#define ROM_STANDARD_ERASE_FRAME_SIZE (1U + STM32_ROM_BOOT_MAX_ERASE_UNITS + 1U)

#define ROM_EXTENDED_ERASE_FRAME_SIZE (2U + (STM32_ROM_BOOT_MAX_ERASE_UNITS * 2U) + 1U)


static uint8_t XorBytes(const uint8_t *data, uint32_t size)
{
    uint8_t value = 0U;
    uint32_t i;

    for (i = 0U; i < size; ++i)
    {
        value ^= data[i];
    }

    return value;
}


static void PutBe32(uint8_t data[4], uint32_t value)
{
    data[0] = (uint8_t) (value >> 24U);
    data[1] = (uint8_t) (value >> 16U);
    data[2] = (uint8_t) (value >> 8U);
    data[3] = (uint8_t) value;
}


static uint32_t RoundUp(uint32_t value, uint32_t alignment)
{
    uint32_t remainder = value % alignment;

    return (remainder == 0U) ? value : (value + alignment - remainder);
}


static void ClearInfo(stm32_rom_boot_info_t *info)
{
    uint32_t i;

    info->bootloader_version = 0U;
    info->device_id          = 0xFFFFU;
    info->command_count      = 0U;

    for (i = 0U; i < STM32_ROM_BOOT_MAX_COMMAND_COUNT; ++i)
    {
        info->commands[i] = 0U;
    }
}


static int HasCommand(const stm32_rom_boot_t *device, uint8_t command)
{
    uint32_t i;

    for (i = 0U; i < device->info.command_count; ++i)
    {
        if (device->info.commands[i] == command)
        {
            return 1;
        }
    }

    return 0;
}


static stm32_rom_boot_status_t Fault(stm32_rom_boot_t *device, stm32_rom_boot_status_t status)
{
    if (device != NULL)
    {
        device->session = STM32_ROM_BOOT_SESSION_FAULTED;
    }

    return status;
}


static stm32_rom_boot_status_t Tx(stm32_rom_boot_t *device, const uint8_t *data, uint32_t size,
                                  uint32_t timeout_ms)
{
    return device->port.transmit(device->port.context, data, size, timeout_ms);
}


static stm32_rom_boot_status_t Rx(stm32_rom_boot_t *device, uint8_t *data, uint32_t size,
                                  uint32_t timeout_ms)
{
    return device->port.receive(device->port.context, data, size, timeout_ms);
}


static stm32_rom_boot_status_t ReceiveAck(stm32_rom_boot_t *device, uint32_t timeout_ms)
{
    uint8_t response;

    stm32_rom_boot_status_t status = Rx(device, &response, 1U, timeout_ms);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    if (response == ROM_NACK)
    {
        return STM32_ROM_BOOT_STATUS_NACK;
    }

    return (response == ROM_ACK) ? STM32_ROM_BOOT_STATUS_OK : STM32_ROM_BOOT_STATUS_PROTOCOL_ERROR;
}


static stm32_rom_boot_status_t SendCommand(stm32_rom_boot_t *device, uint8_t command)
{
    uint8_t frame[2] = {command, (uint8_t) ~command};

    stm32_rom_boot_status_t status =
        Tx(device, frame, sizeof(frame), device->config.command_timeout_ms);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    return ReceiveAck(device, device->config.command_timeout_ms);
}


static stm32_rom_boot_status_t SendAddress(stm32_rom_boot_t *device, uint32_t address)
{
    uint8_t frame[5];

    stm32_rom_boot_status_t status;

    PutBe32(frame, address);

    frame[4] = XorBytes(frame, 4U);

    status = Tx(device, frame, sizeof(frame), device->config.command_timeout_ms);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    return ReceiveAck(device, device->config.command_timeout_ms);
}


static stm32_rom_boot_status_t RequireSession(const stm32_rom_boot_t *device, int ready)
{
    if (device == NULL)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    if ((device->initialized == 0) || (device->profile == NULL))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_STATE;
    }

    if (device->session == STM32_ROM_BOOT_SESSION_FAULTED)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_STATE;
    }

    if (ready != 0)
    {
        return (device->session == STM32_ROM_BOOT_SESSION_READY)
                   ? STM32_ROM_BOOT_STATUS_OK
                   : STM32_ROM_BOOT_STATUS_INVALID_STATE;
    }

    return (device->session == STM32_ROM_BOOT_SESSION_SYNCED) ? STM32_ROM_BOOT_STATUS_OK
                                                              : STM32_ROM_BOOT_STATUS_INVALID_STATE;
}


static stm32_rom_boot_status_t ValidateRange(const stm32_rom_boot_t *device, uint32_t address,
                                             uint32_t size)
{
    uint32_t flash_end;

    if ((device == NULL) || (device->profile == NULL) || (size == 0U))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    flash_end = device->profile->flash_base + device->profile->flash_size;

    if ((address < device->profile->flash_base) || (address >= flash_end) ||
        (size > (flash_end - address)))
    {
        return STM32_ROM_BOOT_STATUS_OUT_OF_RANGE;
    }

    return STM32_ROM_BOOT_STATUS_OK;
}


static stm32_rom_boot_status_t RestoreApplication(stm32_rom_boot_t *device)
{
    stm32_rom_boot_status_t first = STM32_ROM_BOOT_STATUS_OK;

    stm32_rom_boot_status_t status;

    /*
     * BOOT0 low -> next reset boots application Flash.
     */
    status = device->port.set_boot0(device->port.context, 0);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        first = status;
    }

    /*
     * Restore UART configuration used by the normal application.
     */
    status = device->port.configure_uart(device->port.context, STM32_ROM_BOOT_UART_APPLICATION);

    if ((status != STM32_ROM_BOOT_STATUS_OK) && (first == STM32_ROM_BOOT_STATUS_OK))
    {
        first = status;
    }

    /*
     * Assert reset.
     */
    status = device->port.set_reset(device->port.context, 1);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        device->port.delay_ms(device->port.context, device->config.reset_settle_ms);

