yeeeec/stm32h7boot/Drivers/Devices/Stm32RomBoot/stm32_rom_boot.c
        /*
         * Release reset.
         */
        status = device->port.set_reset(device->port.context, 0);
    }

    if ((status != STM32_ROM_BOOT_STATUS_OK) && (first == STM32_ROM_BOOT_STATUS_OK))
    {
        first = status;
    }

    device->session = STM32_ROM_BOOT_SESSION_CLOSED;

    return first;
}


stm32_rom_boot_status_t Stm32RomBoot_Init(stm32_rom_boot_t *device,
                                          const stm32_rom_boot_port_t *port,
                                          const stm32_rom_boot_config_t *config)
{
    const stm32_rom_boot_device_profile_t *profile;

    if ((device == NULL) || (port == NULL) || (config == NULL) || (port->configure_uart == NULL) ||
        (port->transmit == NULL) || (port->receive == NULL) || (port->set_boot0 == NULL) ||
        (port->set_reset == NULL) || (port->delay_ms == NULL) ||
        (config->command_timeout_ms == 0U) || (config->write_timeout_ms == 0U) ||
        (config->erase_timeout_ms == 0U) || (config->reset_settle_ms == 0U))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    if (device->initialized != 0)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_STATE;
    }

    profile = Stm32RomBootDevices_Get(config->target);

    if ((profile == NULL) || (profile->flash_size == 0U) || (profile->erase_unit_size == 0U) ||
        (profile->erase_unit_count == 0U) ||
        (profile->erase_unit_count > STM32_ROM_BOOT_MAX_ERASE_UNITS) ||
        (profile->write_alignment == 0U))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    device->port        = *port;
    device->config      = *config;
    device->profile     = profile;
    device->session     = STM32_ROM_BOOT_SESSION_CLOSED;
    device->initialized = 1;

    ClearInfo(&device->info);

    return STM32_ROM_BOOT_STATUS_OK;
}


stm32_rom_boot_status_t Stm32RomBoot_Enter(stm32_rom_boot_t *device)
{
    uint8_t sync = ROM_SYNC;

    stm32_rom_boot_status_t status;

    if (device == NULL)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    if ((device->initialized == 0) || (device->profile == NULL) ||
        (device->session != STM32_ROM_BOOT_SESSION_CLOSED))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_STATE;
    }

    ClearInfo(&device->info);

    /*
     * STM32 ROM USART bootloader:
     *
     * 8 data bits
     * even parity
     * 1 stop bit
     */
    status = device->port.configure_uart(device->port.context, STM32_ROM_BOOT_UART_ROM_8E1);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    /*
     * BOOT0 high -> System Memory after reset.
     */
    status = device->port.set_boot0(device->port.context, 1);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        (void) RestoreApplication(device);
        return status;
    }

    /*
     * Assert target reset.
     */
    status = device->port.set_reset(device->port.context, 1);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        (void) RestoreApplication(device);
        return status;
    }

    device->port.delay_ms(device->port.context, device->config.reset_settle_ms);

    /*
     * Release reset.
     */
    status = device->port.set_reset(device->port.context, 0);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        (void) RestoreApplication(device);
        return status;
    }

    device->port.delay_ms(device->port.context, device->config.reset_settle_ms);

    /*
     * AN3155 synchronization byte.
     */
    status = Tx(device, &sync, 1U, device->config.command_timeout_ms);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.command_timeout_ms);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        (void) RestoreApplication(device);
        return status;
    }

    device->session = STM32_ROM_BOOT_SESSION_SYNCED;

    return STM32_ROM_BOOT_STATUS_OK;
}


stm32_rom_boot_status_t Stm32RomBoot_GetInfo(stm32_rom_boot_t *device, stm32_rom_boot_info_t *info)
{
    stm32_rom_boot_info_t parsed;

    uint8_t count_minus_one;
    uint8_t id[2];

    uint32_t response_count;

    uint8_t required_erase_command;

    stm32_rom_boot_status_t status;

    if (info == NULL)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    status = RequireSession(device, 0);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    ClearInfo(&parsed);

    /*
     * GET
     */
    status = SendCommand(device, ROM_CMD_GET);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return Fault(device, status);
    }

    /*
     * N: number of following bytes minus one.
     */
    status = Rx(device, &count_minus_one, 1U, device->config.command_timeout_ms);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return Fault(device, status);
    }

    response_count = (uint32_t) count_minus_one + 1U;

    if ((response_count == 0U) || (response_count > (STM32_ROM_BOOT_MAX_COMMAND_COUNT + 1U)))
    {
        return Fault(device, STM32_ROM_BOOT_STATUS_PROTOCOL_ERROR);
    }

    /*
     * response:
     *
     * version
     * command 0
     * command 1
     * ...
     */
    parsed.command_count = (uint8_t) (response_count - 1U);

    status = Rx(device, &parsed.bootloader_version, 1U, device->config.command_timeout_ms);

    if ((status == STM32_ROM_BOOT_STATUS_OK) && (parsed.command_count != 0U))
    {
        status =
            Rx(device, parsed.commands, parsed.command_count, device->config.command_timeout_ms);
    }

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.command_timeout_ms);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return Fault(device, status);
    }

    /*
     * HasCommand() works on device->info.
     */
    device->info = parsed;

    /*
     * Erase command is device-dependent.
     *
     * F103C8:
     *     0x43 Erase
     *
     * H743:
     *     0x44 Extended Erase
     */
    required_erase_command = (device->profile->erase_method == STM32_ROM_BOOT_ERASE_STANDARD)
                                 ? ROM_CMD_ERASE
                                 : ROM_CMD_EXTENDED_ERASE;

    if (!HasCommand(device, ROM_CMD_GET_ID) || !HasCommand(device, ROM_CMD_READ_MEMORY) ||
        !HasCommand(device, ROM_CMD_WRITE_MEMORY) || !HasCommand(device, required_erase_command))
    {
        *info = parsed;

        return Fault(device, STM32_ROM_BOOT_STATUS_NOT_SUPPORTED);
    }

