yeeeec/stm32h7boot/Drivers/Devices/Stm32RomBoot/stm32_rom_boot.c
    /*
     * GET ID
     */
    status = SendCommand(device, ROM_CMD_GET_ID);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = Rx(device, &count_minus_one, 1U, device->config.command_timeout_ms);
    }

    /*
     * STM32 Device ID is two bytes,
     * therefore N must be 1.
     */
    if ((status != STM32_ROM_BOOT_STATUS_OK) || (count_minus_one != 1U))
    {
        *info = parsed;

        return Fault(device, (status != STM32_ROM_BOOT_STATUS_OK)
                                 ? status
                                 : STM32_ROM_BOOT_STATUS_PROTOCOL_ERROR);
    }

    status = Rx(device, id, sizeof(id), device->config.command_timeout_ms);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.command_timeout_ms);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        *info = parsed;
        return Fault(device, status);
    }

    parsed.device_id = (uint16_t) (((uint16_t) id[0] << 8U) | id[1]);

    device->info = parsed;
    *info        = parsed;

    /*
     * Validate selected target against the actual
     * ROM Device ID.
     *
     * Important:
     *
     * STM32F103C8 and F103CB are both medium-density
     * family parts, so Device ID alone must not be
     * used to infer the exact Flash capacity.
     *
     * config.target provides the exact expected target.
     */
    if (parsed.device_id != device->profile->device_id)
    {
        return Fault(device, STM32_ROM_BOOT_STATUS_WRONG_DEVICE);
    }

    device->session = STM32_ROM_BOOT_SESSION_READY;

    return STM32_ROM_BOOT_STATUS_OK;
}


static stm32_rom_boot_status_t ReadBlock(stm32_rom_boot_t *device, uint32_t address, uint8_t *data,
                                         uint32_t size)
{
    uint8_t length[2] = {(uint8_t) (size - 1U), (uint8_t) ~(uint8_t) (size - 1U)};

    stm32_rom_boot_status_t status = SendCommand(device, ROM_CMD_READ_MEMORY);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = SendAddress(device, address);
    }

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = Tx(device, length, sizeof(length), device->config.command_timeout_ms);
    }

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.command_timeout_ms);
    }

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = Rx(device, data, size, device->config.command_timeout_ms);
    }

    return status;
}


stm32_rom_boot_status_t Stm32RomBoot_Read(stm32_rom_boot_t *device, uint32_t address, void *data,
                                          uint32_t size)
{
    uint8_t *output = (uint8_t *) data;

    uint32_t remaining = size;

    stm32_rom_boot_status_t status;

    if (data == NULL)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    status = RequireSession(device, 1);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ValidateRange(device, address, size);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    while (remaining != 0U)
    {
        uint32_t chunk =
            (remaining > STM32_ROM_BOOT_MAX_TRANSFER) ? STM32_ROM_BOOT_MAX_TRANSFER : remaining;

        status = ReadBlock(device, address, output, chunk);

        if (status != STM32_ROM_BOOT_STATUS_OK)
        {
            return Fault(device, status);
        }

        address += chunk;
        output += chunk;
        remaining -= chunk;
    }

    return STM32_ROM_BOOT_STATUS_OK;
}


static stm32_rom_boot_status_t EraseStandard(stm32_rom_boot_t *device, uint32_t first,
                                             uint32_t count)
{
    uint8_t frame[ROM_STANDARD_ERASE_FRAME_SIZE];

    uint32_t i;
    uint32_t payload_size;

    stm32_rom_boot_status_t status;

    /*
     * Standard Erase uses one-byte page numbers.
     */
    if ((count == 0U) || (count > 256U) || ((first + count) > 256U))
    {
        return STM32_ROM_BOOT_STATUS_NOT_SUPPORTED;
    }

    status = SendCommand(device, ROM_CMD_ERASE);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    /*
     * Byte 0:
     *     number of pages - 1
     *
     * Byte 1..N:
     *     page numbers
     *
     * Final byte:
     *     XOR
     */
    frame[0] = (uint8_t) (count - 1U);

    for (i = 0U; i < count; ++i)
    {
        frame[1U + i] = (uint8_t) (first + i);
    }

    payload_size = 1U + count;

    frame[payload_size] = XorBytes(frame, payload_size);

    status = Tx(device, frame, payload_size + 1U, device->config.command_timeout_ms);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.erase_timeout_ms);
    }

    return status;
}


static stm32_rom_boot_status_t EraseExtended(stm32_rom_boot_t *device, uint32_t first,
                                             uint32_t count)
{
    uint8_t frame[ROM_EXTENDED_ERASE_FRAME_SIZE];

    uint32_t i;
    uint32_t payload_size;

    stm32_rom_boot_status_t status;

    if ((count == 0U) || (count > STM32_ROM_BOOT_MAX_ERASE_UNITS) ||
        ((first + count - 1U) > 0xFFFFU))
    {
        return STM32_ROM_BOOT_STATUS_NOT_SUPPORTED;
    }

    status = SendCommand(device, ROM_CMD_EXTENDED_ERASE);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    /*
     * Extended Erase:
     *
     * bytes 0..1:
     *     N = count - 1, big endian
     */
    frame[0] = (uint8_t) ((count - 1U) >> 8U);

    frame[1] = (uint8_t) (count - 1U);

    /*
     * Each erase unit is encoded using two bytes,
     * MSB first.
     */
    for (i = 0U; i < count; ++i)
    {
        uint16_t unit = (uint16_t) (first + i);

        frame[2U + i * 2U] = (uint8_t) (unit >> 8U);

        frame[3U + i * 2U] = (uint8_t) unit;
    }

    payload_size = 2U + count * 2U;

    frame[payload_size] = XorBytes(frame, payload_size);

    status = Tx(device, frame, payload_size + 1U, device->config.command_timeout_ms);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.erase_timeout_ms);
    }

