yeeeec/stm32h7boot/Drivers/Devices/Stm32RomBoot/stm32_rom_boot.c
    return status;
}


stm32_rom_boot_status_t Stm32RomBoot_Erase(stm32_rom_boot_t *device, uint32_t address,
                                           uint32_t size)
{
    uint32_t first;
    uint32_t last;
    uint32_t count;

    int h743_v91_bank2_guard = 0;

    stm32_rom_boot_status_t status = RequireSession(device, 1);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ValidateRange(device, address, size);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    /*
     * Map byte address range onto the target-specific
     * erase-unit geometry.
     *
     * H743:
     *     128 KiB sector
     *
     * F103C8:
     *     1 KiB page
     */
    first = (address - device->profile->flash_base) / device->profile->erase_unit_size;

    last = (address + size - 1U - device->profile->flash_base) / device->profile->erase_unit_size;

    count = last - first + 1U;

    if ((last >= device->profile->erase_unit_count) || (count > STM32_ROM_BOOT_MAX_ERASE_UNITS))
    {
        return STM32_ROM_BOOT_STATUS_OUT_OF_RANGE;
    }

    /*
     * Preserve the original STM32H743 ROM V9.1
     * Bank-2 workaround.
     *
     * It does not affect F103.
     */
    if (((device->profile->quirks & STM32_ROM_BOOT_DEVICE_QUIRK_H743_V91_BANK2_ERASE_GUARD) !=
         0U) &&
        (device->info.bootloader_version == ROM_VERSION_V91) &&
        (device->profile->bank2_first_erase_unit != STM32_ROM_BOOT_NO_BANK2_FIRST_UNIT) &&
        (last >= device->profile->bank2_first_erase_unit))
    {
        h743_v91_bank2_guard = 1;

        if (device->config.v91_bank2_erase_guard_ms == 0U)
        {
            return STM32_ROM_BOOT_STATUS_NOT_SUPPORTED;
        }
    }

    switch (device->profile->erase_method)
    {
        case STM32_ROM_BOOT_ERASE_STANDARD:

            status = EraseStandard(device, first, count);

            break;

        case STM32_ROM_BOOT_ERASE_EXTENDED:

            status = EraseExtended(device, first, count);

            break;

        default:

            return STM32_ROM_BOOT_STATUS_NOT_SUPPORTED;
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return Fault(device, status);
    }

    if (h743_v91_bank2_guard != 0)
    {
        device->port.delay_ms(device->port.context, device->config.v91_bank2_erase_guard_ms);
    }

    return STM32_ROM_BOOT_STATUS_OK;
}


static stm32_rom_boot_status_t WriteBlock(stm32_rom_boot_t *device, uint32_t address,
                                          const uint8_t *data, uint32_t size)
{
    uint8_t frame[STM32_ROM_BOOT_MAX_TRANSFER + 2U];

    uint32_t i;

    stm32_rom_boot_status_t status;

    /*
     * AN3155 Write Memory payload must contain
     * 1..256 bytes and N+1 must be a multiple of 4.
     */
    if ((size == 0U) || (size > STM32_ROM_BOOT_MAX_TRANSFER) || ((size % 4U) != 0U))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    status = SendCommand(device, ROM_CMD_WRITE_MEMORY);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = SendAddress(device, address);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    /*
     * N = number of bytes - 1.
     */
    frame[0] = (uint8_t) (size - 1U);

    for (i = 0U; i < size; ++i)
    {
        frame[i + 1U] = data[i];
    }

    /*
     * XOR includes N and all data bytes.
     */
    frame[size + 1U] = XorBytes(frame, size + 1U);

    status = Tx(device, frame, size + 2U, device->config.command_timeout_ms);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ReceiveAck(device, device->config.write_timeout_ms);
    }

    return status;
}


stm32_rom_boot_status_t Stm32RomBoot_Write(stm32_rom_boot_t *device, uint32_t address,
                                           const void *data, uint32_t size)
{
    const uint8_t *input = (const uint8_t *) data;

    uint8_t padded[STM32_ROM_BOOT_MAX_TRANSFER];

    uint32_t remaining = size;

    uint32_t alignment;
    uint32_t padded_size;
    uint32_t flash_end;

    stm32_rom_boot_status_t status;

    if (data == NULL)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    status = RequireSession(device, 1);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    alignment = device->profile->write_alignment;

    if ((alignment == 0U) || ((address % alignment) != 0U))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    status = ValidateRange(device, address, size);

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    /*
     * Account for final 0xFF padding.
     */
    padded_size = RoundUp(size, alignment);

    flash_end = device->profile->flash_base + device->profile->flash_size;

    if ((padded_size < size) || (padded_size > (flash_end - address)))
    {
        return STM32_ROM_BOOT_STATUS_OUT_OF_RANGE;
    }

    while (remaining != 0U)
    {
        uint32_t actual =
            (remaining > STM32_ROM_BOOT_MAX_TRANSFER) ? STM32_ROM_BOOT_MAX_TRANSFER : remaining;

        uint32_t wire_size = RoundUp(actual, alignment);

        uint32_t i;

        /*
         * AN3155 permits at most 256 bytes per
         * Write Memory operation.
         */
        if ((wire_size > STM32_ROM_BOOT_MAX_TRANSFER) || ((wire_size % 4U) != 0U))
        {
            return STM32_ROM_BOOT_STATUS_NOT_SUPPORTED;
        }

        for (i = 0U; i < actual; ++i)
        {
            padded[i] = input[i];
        }

        /*
         * Pad final packet to protocol alignment.
         */
        for (; i < wire_size; ++i)
        {
            padded[i] = 0xFFU;
        }

        status = WriteBlock(device, address, padded, wire_size);

        if (status != STM32_ROM_BOOT_STATUS_OK)
        {
            return Fault(device, status);
        }

        address += wire_size;
        input += actual;
        remaining -= actual;
    }

    return STM32_ROM_BOOT_STATUS_OK;
}


stm32_rom_boot_status_t Stm32RomBoot_Verify(stm32_rom_boot_t *device, uint32_t address,
                                            const void *data, uint32_t size)
{
    const uint8_t *expected = (const uint8_t *) data;

    uint8_t readback[STM32_ROM_BOOT_MAX_TRANSFER];

    uint32_t remaining = size;

    stm32_rom_boot_status_t status;

    if (data == NULL)
    {
        return STM32_ROM_BOOT_STATUS_INVALID_ARGUMENT;
    }

    status = RequireSession(device, 1);

    if (status == STM32_ROM_BOOT_STATUS_OK)
    {
        status = ValidateRange(device, address, size);
    }

    if (status != STM32_ROM_BOOT_STATUS_OK)
    {
        return status;
    }

    while (remaining != 0U)
    {
        uint32_t chunk = (remaining > sizeof(readback)) ? sizeof(readback) : remaining;

        uint32_t i;

        status = ReadBlock(device, address, readback, chunk);

        if (status != STM32_ROM_BOOT_STATUS_OK)
        {
            return Fault(device, status);
        }

        for (i = 0U; i < chunk; ++i)
        {
            if (readback[i] != expected[i])
            {
                return STM32_ROM_BOOT_STATUS_VERIFY_FAILED;
            }
        }

        address += chunk;
        expected += chunk;
        remaining -= chunk;
    }

    return STM32_ROM_BOOT_STATUS_OK;
}


stm32_rom_boot_status_t Stm32RomBoot_Leave(stm32_rom_boot_t *device)
{
    if ((device == NULL) || (device->initialized == 0) ||
        (device->session == STM32_ROM_BOOT_SESSION_CLOSED))
    {
        return STM32_ROM_BOOT_STATUS_INVALID_STATE;
    }

    return RestoreApplication(device);
}